Importation des modules SQLite3, Pandas, des tables de la database avec les données puis connexion à la base de données

In [1]:
import sqlite3
import pandas as pd
import tables_creation
import datas_integration

conn = sqlite3.connect('e_commerce.db')
c = conn.cursor()

Les différentes requêtes :

Nombre total de clients

In [2]:
clients_number_query = pd.read_sql('SELECT COUNT(DISTINCT customer_unique_id) as nombre_clients FROM Customers', conn)
clients_number_query

   nombre_clients
0           96096

Nombre total de produits

In [3]:
products_number_query = pd.read_sql('SELECT COUNT(product_id) as nombre_produits FROM Products', conn)
products_number_query

   nombre_produits
0            32951

Nombre total de commandes

In [4]:
orders_number_query = pd.read_sql('SELECT COUNT(order_id) as nombre_commandes FROM Orders', conn)
orders_number_query

   nombre_commandes
0             99441

Nombre de produits par catégorie

In [5]:
products_number_by_category_query = pd.read_sql('SELECT product_category_name, COUNT(product_id) as nombre_produit_par_categorie FROM Products GROUP BY product_category_name ORDER BY nombre_produit_par_categorie DESC', conn)
products_number_by_category_query

            product_category_name  nombre_produit_par_categorie
0                 cama_mesa_banho                          3029
1                   esporte_lazer                          2867
2                moveis_decoracao                          2657
3                    beleza_saude                          2444
4           utilidades_domesticas                          2335
..                            ...                           ...
69  fashion_roupa_infanto_juvenil                             5
70                casa_conforto_2                             5
71                       pc_gamer                             3
72             seguros_e_servicos                             2
73              cds_dvds_musicais                             1

[74 rows x 2 columns]

Nombre de commandes selon leurs états

In [6]:
orders_number_by_status_query = pd.read_sql('SELECT order_status as statut_commande, COUNT(order_id) as nombre_commandes FROM Orders GROUP BY order_status ORDER BY nombre_commandes DESC', conn)
orders_number_by_status_query

  statut_commande  nombre_commandes
0       delivered             96478
1         shipped              1107
2        canceled               625
3     unavailable               609
4        invoiced               314
5      processing               301
6         created                 5
7        approved                 2

Nombre de commandes par mois

In [7]:
orders_number_by_month_query = pd.read_sql('''SELECT COUNT(order_id) as nombre_commandes, strftime('%m',order_purchase_timestamp) as Month FROM Orders GROUP BY Month ORDER BY nombre_commandes DESC''', conn)
orders_number_by_month_query

    nombre_commandes Month
0              10843    08
1              10573    05
2              10318    07
3               9893    03
4               9412    06
5               9343    04
6               8508    02
7               8069    01
8               7544    11
9               5674    12
10              4959    10
11              4305    09

Prix moyen d'une commande

In [8]:
order_medium_price_query = pd.read_sql('''WITH Commandes AS (SELECT order_id, SUM(payment_value) as prix_total_commande_par_client FROM Orders_payments GROUP BY order_id ORDER BY prix_total_commande_par_client DESC) SELECT AVG(prix_total_commande_par_client) as prix_moyen_commande FROM Commandes''', conn)
order_medium_price_query

   prix_moyen_commande
0           160.990267

Score de satisfaction moyen

In [9]:
medium_price_query = pd.read_sql('''SELECT AVG(review_score) as score_moyen FROM Orders_reviews''', conn)
medium_price_query

   score_moyen
0     4.073296

Nombre de vendeurs

In [10]:
sellers_number_query = pd.read_sql('''SELECT COUNT(seller_id) as nombre_vendeurs FROM Sellers''', conn)
sellers_number_query

   nombre_vendeurs
0             3095

Nombre de vendeurs par région

In [11]:
sellers_number_by_state_query = pd.read_sql('''SELECT seller_state, COUNT(seller_id) as vendeurs_par_region FROM Sellers GROUP BY seller_state ORDER BY vendeurs_par_region DESC''', conn)
sellers_number_by_state_query

   seller_state  vendeurs_par_region
0            SP                 1849
1            PR                  349
2            MG                  244
3            SC                  190
4            RJ                  171
5            RS                  129
6            GO                   40
7            DF                   30
8            ES                   23
9            BA                   19
10           CE                   13
11           PE                    9
12           PB                    6
13           RN                    5
14           MS                    5
15           MT                    4
16           SE                    2
17           RO                    2
18           PI                    1
19           PA                    1
20           MA                    1
21           AM                    1
22           AC                    1

Quantité de produits vendus par catégorie

In [12]:
sold_products_by_category_query = pd.read_sql('''SELECT p.product_category_name as Categorie_produit, COUNT(o.order_id) as Nombre_commandes FROM Orders_items as o INNER JOIN Products as p ON o.product_id = p.product_id GROUP BY p.product_category_name ORDER BY Nombre_commandes DESC''', conn)
sold_products_by_category_query

                Categorie_produit  Nombre_commandes
0                 cama_mesa_banho             11115
1                    beleza_saude              9670
2                   esporte_lazer              8641
3                moveis_decoracao              8334
4          informatica_acessorios              7827
..                            ...               ...
69                     la_cuisine                14
70              cds_dvds_musicais                14
71                       pc_gamer                 9
72  fashion_roupa_infanto_juvenil                 8
73             seguros_e_servicos                 2

[74 rows x 2 columns]

Nombre de commandes par jour (méthode 1 : selon le jour de la semaine où 'Dimanche' = 0)

In [13]:
orders_number_by_day_query1 = pd.read_sql('''SELECT COUNT(order_id) as nombre_commandes, strftime('%w',order_purchase_timestamp) as Day_of_Week FROM Orders GROUP BY Day_of_Week ORDER BY nombre_commandes DESC''', conn)
orders_number_by_day_query1

   nombre_commandes Day_of_Week
0             16196           1
1             15963           2
2             15552           3
3             14761           4
4             14122           5
5             11960           0
6             10887           6

Nombre de commandes par jour (méthode 2 : selon le jour du mois)

In [14]:
orders_number_by_day_query2 = pd.read_sql('''SELECT COUNT(order_id) as nombre_commandes, strftime('%d',order_purchase_timestamp) as Day_of_Month FROM Orders GROUP BY Day_of_Month ORDER BY nombre_commandes DESC''', conn)
orders_number_by_day_query2

    nombre_commandes Day_of_Month
0               3877           24
1               3581           16
2               3524           15
3               3483           04
4               3468           06
5               3445           05
6               3430           18
7               3387           14
8               3364           19
9               3363           07
10              3326           08
11              3308           11
12              3290           26
13              3290           25
14              3283           03
15              3277           13
16              3271           09
17              3261           20
18              3213           02
19              3202           12
20              3200           17
21              3181           22
22              3168           10
23              3128           23
24              3122           27
25              3116           21
26              3101           01
27              3011           28
28              2557           29
29              2534           30
30              1680           31

Durée moyenne entre la commande et la livraison

In [15]:
delivered_order_medium_time_query = pd.read_sql('''SELECT AVG(julianday(order_delivered_customer_date) - julianday(order_purchase_timestamp)) as duree_livraison_en_jours FROM Orders ''', conn)
delivered_order_medium_time_query

   duree_livraison_en_jours
0                 12.558702

Nombre de commandes par ville du vendeur

In [16]:
orders_number_by_city_query = pd.read_sql('''SELECT s.seller_city as Ville_vendeur, COUNT(o.order_id) as Nombre_commandes FROM Orders_items as o INNER JOIN Sellers as s ON o.seller_id = s.seller_id GROUP BY Ville_vendeur ORDER BY Nombre_commandes DESC''', conn)
orders_number_by_city_query

         Ville_vendeur  Nombre_commandes
0            sao paulo             27983
1             ibitinga              7750
2             curitiba              3016
3          santo andre              2964
4       belo horizonte              2593
..                 ...               ...
606           araquari                 1
607  angra dos reis rj                 1
608    aguas claras df                 1
609    abadia de goias                 1
610           04482255                 1

[611 rows x 2 columns]

Prix minimum des commandes

In [17]:
orders_minimum_price_query = pd.read_sql('''WITH Commandes AS (SELECT order_id, SUM(payment_value) as prix_total_commande_par_client FROM Orders_payments GROUP BY order_id ORDER BY prix_total_commande_par_client DESC) SELECT MIN(prix_total_commande_par_client) as prix_minimum_commandes FROM Commandes''', conn)
orders_minimum_price_query

   prix_minimum_commandes
0                     0.0

Prix maximum des commandes

In [18]:
orders_maximum_price_query = pd.read_sql('''WITH Commandes AS (SELECT order_id, SUM(payment_value) as prix_total_commande_par_client FROM Orders_payments GROUP BY order_id ORDER BY prix_total_commande_par_client DESC) SELECT MAX(prix_total_commande_par_client) as prix_minimum_commandes FROM Commandes''', conn)
orders_maximum_price_query

   prix_minimum_commandes
0                13664.08

Temps moyen d'une livraison par mois

In [19]:
delivery_medium_time_by_month_query = pd.read_sql('''SELECT strftime('%m',order_purchase_timestamp) as Month, AVG(julianday(order_delivered_customer_date) - julianday(order_purchase_timestamp)) as duree_livraison_par_mois_en_jours FROM Orders GROUP BY Month ''', conn)
delivery_medium_time_by_month_query

   Month  duree_livraison_par_mois_en_jours
0     01                          13.943059
1     02                          16.186325
2     03                          15.408157
3     04                          12.364333
4     05                          11.385740
5     06                          10.180754
6     07                           9.975710
7     08                           9.090552
8     09                          11.861356
9     10                          12.295812
10    11                          15.161132
11    12                          15.392978